src/Catalogs/уатВнешниеСистемы/уатВнешниеСистемы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>уатВнешниеСистемы</name>
  <comment>(уат)</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>_1СЦСМ</name>
      <description>1С:Центр спутникового мониторинга</description>
    </items>
    <items>
      <name>MultiGo</name>
      <description>MultiGo</description>
    </items>
    <items>
      <name>Omnicomm</name>
      <description>Omnicomm</description>
    </items>
    <items>
      <name>Wialon</name>
      <description>Wialon</description>
    </items>
    <items>
      <name>АвтоГРАФ</name>
      <description>АвтоГРАФ</description>
    </items>
    <items>
      <name>Автодор</name>
      <description>Автодор</description>
    </items>
    <items>
      <name>Газпромнефть</name>
      <description>Газпромнефть</description>
    </items>
    <items>
      <name>ЛукойлЛИКАРД</name>
      <description>Лукойл ЛИКАРД</description>
    </items>
    <items>
      <name>Паркоматика</name>
      <description>Паркоматика</description>
    </items>
    <items>
      <name>Платон</name>
      <description>Платон</description>
    </items>
    <items>
      <name>ППР</name>
      <description>ППР</description>
    </items>
    <items>
      <name>СКАУТ</name>
      <description>СКАУТ</description>
    </items>
    <items>
      <name>Роснефть</name>
      <description>Топливные карты Роснефть</description>
    </items>
    <items>
      <name>ШтрафовНет</name>
      <description>Штрафов НЕТ</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипВнешнейСистемы</name>
    <type>
      <types>EnumRef.уатТипыВнешнихСистем</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПС</name>
    <comment>(уат)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Enums/уатТипыВнешнихСистем/уатТипыВнешнихСистем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатТипыВнешнихСистем</name>
  <comment>Типы внешних систем (уат)</comment>
  <enumValues>
    <name>СистемаМониторинга</name>
    <comment>Система мониторинга.</comment>
  </enumValues>
  <enumValues>
    <name>ПроцессинговыйЦентр</name>
    <comment>Процессинговый центр.</comment>
  </enumValues>
  <enumValues>
    <name>СистемаВзиманияПлаты</name>
    <comment>Система взимания платы.</comment>
  </enumValues>
  <enumValues>
    <name>СервисШтрафов</name>
    <comment>Сервис штрафов</comment>
  </enumValues>
  <enumValues>
    <name>СервисПарковок</name>
    <comment>Сервис парковок</comment>
  </enumValues>
  <enumValues>
    <name>СервисСтрахования</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/уатВнешниеСистемы/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выполняет заполнение предопределенных элементов справочника
//
Процедура ЗаполнитьПредопределенныеДанные() Экспорт
	
	СпрОбъект = Справочники.уатВнешниеСистемы._1СЦСМ.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.СистемаМониторинга;
	СпрОбъект.Записать();
		
	СпрОбъект = Справочники.уатВнешниеСистемы.Omnicomm.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.СистемаМониторинга;
	СпрОбъект.Записать();

	СпрОбъект = Справочники.уатВнешниеСистемы.Wialon.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.СистемаМониторинга;
	СпрОбъект.Записать();

	СпрОбъект = Справочники.уатВнешниеСистемы.АвтоГРАФ.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.СистемаМониторинга;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатВнешниеСистемы.СКАУТ.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.СистемаМониторинга;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатВнешниеСистемы.Газпромнефть.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.ПроцессинговыйЦентр;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатВнешниеСистемы.Платон.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.СистемаВзиманияПлаты;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатВнешниеСистемы.ШтрафовНет.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.СервисШтрафов;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатВнешниеСистемы.Паркоматика.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.СервисПарковок;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатВнешниеСистемы.ППР.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.ПроцессинговыйЦентр;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатВнешниеСистемы.ЛукойлЛИКАРД.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.ПроцессинговыйЦентр;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатВнешниеСистемы.Роснефть.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.ПроцессинговыйЦентр;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатВнешниеСистемы.Автодор.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.СистемаВзиманияПлаты;
	СпрОбъект.Записать();	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
